In [1]:
import warnings
warnings.filterwarnings(action='ignore') 

import pandas as pd
import numpy as np
import csv
import folium
import matplotlib.pyplot as plt
plt.rc('font',family='D2CodingLigature Nerd Font')

### 문자열 함수

In [4]:
df = pd.DataFrame({"높이":['1,250미터','740','높이1,130미터']})
df

          높이
0    1,250미터
1        740
2  높이1,130미터

In [5]:
df['높이'].str.find('높')   ## 지정한 문자열을 찾아서, 그 인덱스 반환, 해당 문자열이 없으면 -1

0   -1
1   -1
2    0
Name: 높이, dtype: int64

In [6]:
df['높이'].str.find('0')

0    4
1    2
2    6
Name: 높이, dtype: int64

In [7]:
df['높이'] = df['높이'].str.strip()   ## 문자열 양 끝의 공백 또는 해당 문자 제거
df

          높이
0    1,250미터
1        740
2  높이1,130미터

In [9]:
df['높이'] = df['높이'].str.rstrip('미터')    ## 오른쪽 공백 또는 해당 문자('미터') 제거
df

        높이
0    1,250
1      740
2  높이1,130

In [10]:
df['높이'] = df['높이'].str.lstrip('높이')    ## 왼쪽 공백 또는 해당 문자 제거
df

      높이
0  1,250
1    740
2  1,130

In [ ]:
df['높이'] = df['높이'].str.replace(',','')    ## 해당 문자 교체 (컴마를 제거)
df

     높이
0  1250
1   740
2  1130

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   높이      3 non-null      object
dtypes: object(1)
memory usage: 156.0+ bytes

In [13]:
# 문자열 -> 숫자

df['높이'] = df['높이'].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   높이      3 non-null      int64
dtypes: int64(1)
memory usage: 156.0 bytes

In [14]:
df = pd.DataFrame({"높이":['1,250미터','740','높이1,130미터']})
df

          높이
0    1,250미터
1        740
2  높이1,130미터

In [ ]:
# df에서 문자만 추출(정규표현식 사용)

df['string'] = df['높이'].replace(r'[0-9,]', '', regex=True)    # 숫자를 제거
df

          높이 string
0    1,250미터     미터
1        740
2  높이1,130미터   높이미터